STATUS_TRANSLATION = {
    "demo": "Демо",
    "unlim": "Необмежений",
    "admin": "Адміністратор",
}

UKRAINIAN_NAMES = [
    "Артем",
    "Дмитро",
    "Олександр",
    "Сергій",
    "Владислав",
    "Олег",
    "Іван",
    "Максим",
    "Анна",
    "Марія",
    "Ксенія",
    "Тетяна",
    "Олена",
    "Ярослав",
    "Катерина",
    "Софія",
]

OPERATORS = {
    "Vodafone": ["50", "66", "99"],
    "Київстар": ["67", "68", "96", "97", "98"],
    "lifecell": ["63", "73", "93", "95"],
}

FREQUENCIES = {
    "Без затримки 🚀": 0,
    "1 заявка в 10 секунд ⏳": 10,
    "1 заявка в 10 хвилин ⌛": 10 * 60,
    "1 заявка в 60 хвилин ⌛": 60 * 60,
}

DURATIONS = {
    "1 хвилина ⏳": 60,
    "15 хвилин ⏳": 15 * 60,
    "30 хвилин ⏳": 30 * 60,
    "1 година ⏳": 60 * 60,
    "3 години ⏳": 3 * 60 * 60,
    "Необмежено ⏳": None,
}
